app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."category" = $1  [["category", "category 2"]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."feedback" = $1) AND "articles"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."feedback" = $2) AND "articles"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."feedback" = $3) AND "articles"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."feedback" = $4) AND "articles"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."feedback" = $5)  [["feedback", "Good"], ["feedback", "Good"], ["feedback", "Good"], ["feedback", "Good"], ["feedback", "Good"]]
---
  def index
    @articles = Article.all if params[:category].blank?
    @articles = Article.search_result(params[:category], params[:author], params[:title], params[:description], params[:feedback]) if params[:category].present?

INSERT INTO "articles" ("title", "category", "description", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = $1, "category" = $2, "description" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "title1"], ["category", "catrgory1"], ["description", "this is description for first article"], ["updated_at", "2017-11-17 15:22:33.075213"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)