app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commentor", "body", "feedback", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commentor", "sasadsa"], ["body", "asddasasd"], ["feedback", "dsaasd"], ["article_id", 1], ["created_at", "2017-11-17 05:45:19.970726"], ["updated_at", "2017-11-17 05:45:19.970726"]]